src/test/resources/trackingRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://webservice.trace.chronopost.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getSimpleTraceURL>
            <gs:pSkybillNumber>11222222EDS123</gs:pSkybillNumber>
            <gs:pLanguage>PT</gs:pLanguage>
        </gs:getSimpleTraceURL>
    </soapenv:Body>
</soapenv:Envelope>
